WK6D2/first_routes_and_controllers/app/controllers/users_controller.rb

  def update
    user = User.find(params[:id])
    if user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "flippynippsThaDestroya"], ["updated_at", "2021-01-06 06:43:20.168874"], ["id", 4]]